# pandas implementation

# pip install pandas
sudo pip install pandas

In [79]:
import pandas as pd

In [80]:
s=pd.Series(["a","b","c","d","e","f","g","h"])

In [81]:
s

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

In [82]:
d=(34,45,78,23,56,98,73,32,53,65)
i=("a","b","c","d","e","f","g","h","i","j")

In [83]:
s1=pd.Series(data=d,index=i)

In [84]:
s1

a    34
b    45
c    78
d    23
e    56
f    98
g    73
h    32
i    53
j    65
dtype: int64

In [85]:
d={
    "d1":1,
    "d2":2
}

In [86]:
i=[1,2]

In [87]:
s3=pd.Series(d)

In [88]:
s3

d1    1
d2    2
dtype: int64

In [89]:
import numpy as np
import pandas as pd

In [90]:
l=[1,2,3]
d=[5,6,7]
a=np.array(d)

In [91]:
a

array([5, 6, 7])

In [92]:
pd.Series(d,l)

1    5
2    6
3    7
dtype: int64

# dataframes

In [93]:
df=pd.read_csv(r"C:\Users\ANKIT\Downloads\gender_development.csv")

In [94]:
df

     GDIRank                   Country Genderdevelopment  female   Male
0          1                    Norway              0.996  57140  72825
1          2                 Australia              0.976  33688  50914
2          3               Switzerland               0.95  44132  69077
3          4                   Denmark              0.977  36439  51727
4          5               Netherlands              0.947  29500  61641
..       ...                       ...                ...    ...    ...
183      184                   Burundi              0.911    693    825
184      185                      Chad              0.768   1657   2513
185      186                   Eritrea                 ..    971   1290
186      187  Central African Republic              0.773    476    689
187      188                     Niger              0.729    491   1319

[188 rows x 5 columns]

In [95]:
df.shape

(188, 5)

In [96]:
dc={
    "name":["aaa","bbb","ccc","ddd"],
    "rollno":[11,12,13,14],
    "sub":["os","co","java","dotnet"]
}

In [97]:
df2=pd.DataFrame(dc)

In [98]:
df2

  name  rollno     sub
0  aaa      11      os
1  bbb      12      co
2  ccc      13    java
3  ddd      14  dotnet

In [99]:
df2.shape

(4, 3)

In [100]:
rows,columns=df.shape

In [101]:
rows

188

In [102]:
columns

5

In [103]:
df.head(10)

   GDIRank        Country Genderdevelopment  female   Male
0        1         Norway              0.996  57140  72825
1        2      Australia              0.976  33688  50914
2        3    Switzerland               0.95  44132  69077
3        4        Denmark              0.977  36439  51727
4        5    Netherlands              0.947  29500  61641
5        6        Germany              0.963  34886  53290
6        6        Ireland              0.973  30104  49166
7        8  United States              0.995  43054  63158
8        9         Canada              0.982  33587  50853
9        9    New Zealand              0.961  24309  41372

In [104]:
df.tail(10)

     GDIRank                   Country Genderdevelopment  female  Male
178      179                      Mali              0.776    961  2195
179      180                Mozambique              0.881   1040  1210
180      181              Sierra Leone              0.814   1582  1981
181      182                    Guinea              0.778    877  1314
182      183              Burkina Faso              0.881   1325  1859
183      184                   Burundi              0.911    693   825
184      185                      Chad              0.768   1657  2513
185      186                   Eritrea                 ..    971  1290
186      187  Central African Republic              0.773    476   689
187      188                     Niger              0.729    491  1319

In [105]:
df[2:8]

   GDIRank        Country Genderdevelopment  female   Male
2        3    Switzerland               0.95  44132  69077
3        4        Denmark              0.977  36439  51727
4        5    Netherlands              0.947  29500  61641
5        6        Germany              0.963  34886  53290
6        6        Ireland              0.973  30104  49166
7        8  United States              0.995  43054  63158

In [106]:
df[:]

     GDIRank                   Country Genderdevelopment  female   Male
0          1                    Norway              0.996  57140  72825
1          2                 Australia              0.976  33688  50914
2          3               Switzerland               0.95  44132  69077
3          4                   Denmark              0.977  36439  51727
4          5               Netherlands              0.947  29500  61641
..       ...                       ...                ...    ...    ...
183      184                   Burundi              0.911    693    825
184      185                      Chad              0.768   1657   2513
185      186                   Eritrea                 ..    971   1290
186      187  Central African Republic              0.773    476    689
187      188                     Niger              0.729    491   1319

[188 rows x 5 columns]

In [107]:
df.columns

Index(['GDIRank', 'Country', 'Genderdevelopment ', 'female', 'Male'], dtype='object')

In [108]:
df.Country

0                        Norway
1                     Australia
2                   Switzerland
3                       Denmark
4                   Netherlands
                 ...
183                     Burundi
184                        Chad
185                     Eritrea
186    Central African Republic
187                       Niger
Name: Country, Length: 188, dtype: object

In [109]:
df["Country"]

0                        Norway
1                     Australia
2                   Switzerland
3                       Denmark
4                   Netherlands
                 ...
183                     Burundi
184                        Chad
185                     Eritrea
186    Central African Republic
187                       Niger
Name: Country, Length: 188, dtype: object

In [110]:
type(df["Country"])

pandas.core.series.Series

In [111]:
type(df)

pandas.core.frame.DataFrame

In [112]:
df[["Country","female"]]

                      Country female
0                      Norway  57140
1                   Australia  33688
2                 Switzerland  44132
3                     Denmark  36439
4                 Netherlands  29500
..                        ...    ...
183                   Burundi    693
184                      Chad   1657
185                   Eritrea    971
186  Central African Republic    476
187                     Niger    491

[188 rows x 2 columns]

In [113]:
df["Country"].describe()

count        188
unique       188
top       Guyana
freq           1
Name: Country, dtype: object

In [114]:
df

     GDIRank                   Country Genderdevelopment  female   Male
0          1                    Norway              0.996  57140  72825
1          2                 Australia              0.976  33688  50914
2          3               Switzerland               0.95  44132  69077
3          4                   Denmark              0.977  36439  51727
4          5               Netherlands              0.947  29500  61641
..       ...                       ...                ...    ...    ...
183      184                   Burundi              0.911    693    825
184      185                      Chad              0.768   1657   2513
185      186                   Eritrea                 ..    971   1290
186      187  Central African Republic              0.773    476    689
187      188                     Niger              0.729    491   1319

[188 rows x 5 columns]

In [115]:
df[df["female"]<=4000]

TypeError: '<=' not supported between instances of 'str' and 'int'

In [116]:
df[df.female==df.female.max()]

    GDIRank   Country Genderdevelopment  female   Male
96       97  Colombia              0.997   9785  14372

In [117]:
df.female.max()

'9785'

In [122]:
df.Male.max()

'9718'

In [120]:
df["Male"].min()

'..'

In [123]:
df.loc[4]

GDIRank                         5
Country               Netherlands
Genderdevelopment           0.947
female                      29500
Male                        61641
Name: 4, dtype: object

In [124]:
df.loc[99]

GDIRank                 100
Country               Tonga
Genderdevelopment     0.967
female                 3796
Male                   6336
Name: 99, dtype: object

In [125]:
df[90:100]

    GDIRank                           Country Genderdevelopment  female   Male
90       90                              Fiji              0.941   4274  10592
91       90                          Mongolia              1.028   9029  12462
92       93                          Thailand                  1  11820  14888
93       94                          Dominica                 ..     ..     ..
94       94                             Libya               0.95   7427  22392
95       96                           Tunisia              0.894   4748  16159
96       97                          Colombia              0.997   9785  14372
97       97  Saint Vincent and the Grenadines                 ..   7283  12541
98       99                           Jamaica              0.995   5820   9059
99      100                             Tonga              0.967   3796   6336

In [132]:
df[df["female"]==-0.893]

Empty DataFrame
Columns: [GDIRank, Country, Genderdevelopment , female, Male]
Index: []

In [133]:
df[(df["female"]==4)| (df["Male"]==5)]

Empty DataFrame
Columns: [GDIRank, Country, Genderdevelopment , female, Male]
Index: []

In [139]:
df[df["Male"].isin([14372])]

Empty DataFrame
Columns: [GDIRank, Country, Genderdevelopment , female, Male]
Index: []

In [140]:
df.head()

   GDIRank      Country Genderdevelopment  female   Male
0        1       Norway              0.996  57140  72825
1        2    Australia              0.976  33688  50914
2        3  Switzerland               0.95  44132  69077
3        4      Denmark              0.977  36439  51727
4        5  Netherlands              0.947  29500  61641

In [141]:
df[(df["female"]<4000) & (df["Male"]>5000)]

TypeError: '<' not supported between instances of 'str' and 'int'

In [142]:
df[["Male","female"]][:9]

    Male female
0  72825  57140
1  50914  33688
2  69077  44132
3  51727  36439
4  61641  29500
5  53290  34886
6  49166  30104
7  63158  43054
8  50853  33587

In [144]:
df.iloc[0:80:6]

    GDIRank            Country Genderdevelopment  female   Male
0         1             Norway              0.996  57140  72825
6         6            Ireland              0.973  30104  49166
12       13      Liechtenstein                 ..     ..     ..
18       19         Luxembourg              0.971  47723  69800
24       25           Slovenia              0.996  22180  33593
30       31  Brunei Darussalam              0.977  54228  90437
36       37          Lithuania               1.03  20955  28656
42       43           Portugal              0.985  21259  30543
48       49         Montenegro              0.954  11106  18094
54       55            Bahamas                 ..  17868  24957
60       60             Panama              0.996  13699  22597
66       67               Cuba              0.954   4912   9665
72       73          Sri Lanka              0.948   5452  14307
78       79            Grenada                 ..     ..     ..

In [145]:
df.iloc[[134,29,36,99]]

     GDIRank    Country Genderdevelopment  female   Male
134      134    Vanuatu              0.903   2141   3445
29        30    Estonia               1.03  20854  30254
36        37  Lithuania               1.03  20955  28656
99       100      Tonga              0.967   3796   6336

In [146]:
df["Male"].value_counts()

..       11
9665      1
28287     1
9059      1
9718      1
         ..
14307     1
32122     1
34400     1
33604     1
7124      1
Name: Male, Length: 178, dtype: int64

In [155]:
d=df.fillna(method="bfill")

In [156]:
d.head()

   GDIRank      Country Genderdevelopment  female   Male
0        1       Norway              0.996  57140  72825
1        2    Australia              0.976  33688  50914
2        3  Switzerland               0.95  44132  69077
3        4      Denmark              0.977  36439  51727
4        5  Netherlands              0.947  29500  61641

In [157]:
s=df.dropna()

In [159]:
s

     GDIRank                   Country Genderdevelopment  female   Male
0          1                    Norway              0.996  57140  72825
1          2                 Australia              0.976  33688  50914
2          3               Switzerland               0.95  44132  69077
3          4                   Denmark              0.977  36439  51727
4          5               Netherlands              0.947  29500  61641
..       ...                       ...                ...    ...    ...
183      184                   Burundi              0.911    693    825
184      185                      Chad              0.768   1657   2513
185      186                   Eritrea                 ..    971   1290
186      187  Central African Republic              0.773    476    689
187      188                     Niger              0.729    491   1319

[188 rows x 5 columns]

In [162]:
df.drop(df.female[40]).head(20)

KeyError: "['22391'] not found in axis"

In [165]:
df1=pd.read_html("https://www.bankrate.com/banking/cds/cd-rates/")

In [166]:
df1

[                            Bank       Rate Minimum Deposit To Open
 0                     BrioDirect  0.50% APY                    $500
 1  Bethpage Federal Credit Union  0.40% APY                     $50
 2      Navy Federal Credit Union  0.40% APY                  $1,000,
               Bank       Rate Minimum Deposit To Open
 0     Quontic Bank  0.60% APY                  $2,500
 1   Limelight Bank  0.50% APY                  $1,000
 2  MySavingsDirect  0.50% APY                  $1,000,
                         Bank       Rate Minimum Deposit To Open
 0  Navy Federal Credit Union  0.50% APY                  $1,000
 1        VyStar Credit Union  0.35% APY                    $500
 2              Discover Bank  0.30% APY                  $2,500,
                            Bank       Rate Minimum Deposit To Open
 0  Delta Community Credit Union  0.80% APY                  $1,000
 1                  Quontic Bank  0.65% APY                    $500
 2                     Ally Bank  0.60% APY                      $0,
                            Bank       Rate Minimum Deposit To Open
 0  Delta Community Credit Union  0.95% APY                  $1,000
 1                  Quontic Bank  0.70% APY                    $500
 2                 Live Oak Bank  0.70% APY                  $2,500,
                            Bank       Rate Minimum Deposit To Open
 0  Delta Community Credit Union  1.05% APY                  $1,000
 1     Navy Federal Credit Union  0.85% APY                  $1,000
 2                  Quontic Bank  0.75% APY                    $500,
                              Bank       Rate Minimum Deposit To Open
 0             VyStar Credit Union  0.90% APY                    $500
 1  First Internet Bank of Indiana  0.86% APY                  $1,000
 2           Golden 1 Credit Union  0.80% APY                    $500,
                              Bank       Rate Minimum Deposit To Open
 0    Delta Community Credit Union  1.25% APY                  $1,000
 1  First National Bank of America  1.00% APY                  $1,000
 2           Golden 1 Credit Union  0.90% APY                    $500,
   CD Term CD National Average APY
 0  1-year                   0.21%
 1  2-year                   0.26%
 2  3-year                   0.29%
 3  4-year                   0.32%
 4  5-year                   0.36%,
         Term    APY Minimum Deposit
 0   6 months  0.15%            $500
 1   9 months  0.25%            $500
 2  12 months  0.55%            $500
 3  18 months  0.55%            $500
 4  24 months  0.55%            $500
 5    3 years  0.55%            $500
 6    4 years  0.55%            $500
 7    5 years  0.60%            $500
 8    6 years  0.60%            $500,
          Term    APY Minimum Deposit
 0    3 months  0.15%          $2,000
 1    6 months  0.25%          $2,000
 2    9 months  0.35%          $2,000
 3   12 months  0.60%          $2,000
 4   13 months  0.60%          $2,000
 5   14 months  0.60%          $2,000
 6   15 months  0.60%          $2,000
 7   18 months  0.60%          $2,000
 8   24 months  0.65%          $2,000
 9     3 years  0.70%          $2,000
 10    4 years  0.70%          $2,000
 11    5 years  0.80%          $2,000,
         Term    APY Minimum Deposit
 0   3 months  0.10%              $0
 1   6 months  0.10%              $0
 2   9 months  0.10%              $0
 3  12 months  0.30%              $0
 4  18 months  0.30%              $0
 5  24 months  0.30%              $0
 6    3 years  0.30%              $0
 7    4 years  0.30%              $0
 8    5 years  0.30%              $0,
         Term    APY Minimum Deposit
 0  12 months  0.60%          $1,500
 1  24 months  0.75%          $1,500
 2    3 years  0.85%          $1,500
 3    4 years  0.85%          $1,500
 4    5 years  0.90%          $1,500,
         Term    APY Minimum Deposit
 0  12 months  0.20%          $5,000
 1  24 months  0.20%          $5,000
 2    3 years  0.25%          $5,000
 3    4 years  0.30%          $5,000
 4    5 years  0.35%          $5,000,
         Term    APY Minimum Deposit
 0   6 months  0.10%              $0
 1  12 months  0.20%              $0
 2  18 months  0.30%              $0
 3  24 months  0.40%              $0
 4    3 years  0.45%              $0
 5    4 years  0.50%              $0
 6    5 years  0.55%              $0,
         Term    APY Minimum Deposit
 0  12 months  0.60%         $10,000
 1  18 months  0.60%         $10,000
 2  24 months  0.60%         $10,000
 3    3 years  0.60%         $10,000
 4    4 years  0.60%         $10,000
 5    5 years  0.60%         $10,000,
         Term      APY Minimum Deposit
 0   3 months    0.20%              $0
 1   6 months    0.25%              $0
 2   9 months    0.30%              $0
 3  11 months   0.50%*              $0
 4  12 months    0.60%              $0
 5  18 months    0.60%              $0
 6  24 months  0.60%**              $0
 7    3 years    0.65%              $0
 8    4 years  0.60%**              $0
 9    5 years    0.85%              $0,
         Term    APY Minimum Deposit
 0   6 months  0.20%              $0
 1   9 months  0.20%              $0
 2  12 months  0.20%              $0
 3  18 months  0.25%              $0
 4  24 months  0.25%              $0
 5  30 months  0.25%              $0
 6    3 years  0.30%              $0
 7    4 years  0.35%              $0
 8    5 years  0.40%              $0,
           Term    APY Minimum Deposit
 0     6 months  0.15%         $10,000
 1   11 months*  0.15%         $10,000
 2          NaN    NaN             NaN
 3    12 months  0.25%         $10,000
 4   13 months*  0.10%         $10,000
 5   14 months*  0.10%         $10,000
 6    15 months  0.25%         $10,000
 7    18 months  0.25%         $10,000
 8    24 months  0.25%         $10,000
 9    30 months  0.25%         $10,000
 10     3 years  0.25%         $10,000
 11     4 years  0.25%         $10,000
 12     5 years  0.25%         $10,000,
         Term    APY Minimum Deposit
 0  6 months*  0.25%            $500
 1  10 months  0.25%            $500,
          Term    APY Minimum Deposit
 0    6 months  0.30%          $1,000
 1  11 months*  0.30%          $1,000
 2   12 months  0.30%          $1,000
 3   13 months  0.30%          $1,000
 4   18 months  0.30%          $1,000
 5   24 months  0.40%          $1,000
 6     3 years  0.40%          $1,000
 7     4 years  0.50%          $1,000
 8     5 years  0.50%          $1,000,
                               Bank 1-year APY 3-year APY 5-year APY  \
 0          Marcus by Goldman Sachs      0.55%      0.55%      0.60%
 1                   Synchrony Bank      0.60%      0.70%      0.80%
 2                    Barclays Bank      0.30%      0.30%      0.30%
 3                  Comenity Direct      0.60%      0.85%      0.90%
 4                  Citizens Access      0.20%      0.25%      0.35%
 5   American Express National Bank      0.20%      0.45%      0.55%
 6                     Amerant Bank      0.60%      0.60%      0.60%
 7                        Ally Bank      0.60%      0.65%      0.85%
 8                      Capital One      0.20%      0.30%      0.40%
 9              PurePoint Financial      0.25%      0.25%      0.25%
 10                        CIT Bank      0.30%      0.40%      0.50%

    Minimum Deposit
 0             $500
 1           $2,000
 2               $0
 3           $1,500
 4           $5,000
 5               $0
 6          $10,000
 7               $0
 8               $0
 9          $10,000
 10          $1,000  ]

In [167]:
len(df1)

22

In [168]:
df1[0]

                            Bank       Rate Minimum Deposit To Open
0                     BrioDirect  0.50% APY                    $500
1  Bethpage Federal Credit Union  0.40% APY                     $50
2      Navy Federal Credit Union  0.40% APY                  $1,000

In [170]:
df1[7]

                             Bank       Rate Minimum Deposit To Open
0    Delta Community Credit Union  1.25% APY                  $1,000
1  First National Bank of America  1.00% APY                  $1,000
2           Golden 1 Credit Union  0.90% APY                    $500

In [171]:
import webbrowser

In [172]:
webbrowser.open("https://www.wikipedia.org/")

True

In [176]:
df["female"]

0      57140
1      33688
2      44132
3      36439
4      29500
       ...
183      693
184     1657
185      971
186      476
187      491
Name: female, Length: 188, dtype: object

In [177]:
df.drop(["female"],axis=1)

     GDIRank                   Country Genderdevelopment    Male
0          1                    Norway              0.996  72825
1          2                 Australia              0.976  50914
2          3               Switzerland               0.95  69077
3          4                   Denmark              0.977  51727
4          5               Netherlands              0.947  61641
..       ...                       ...                ...    ...
183      184                   Burundi              0.911    825
184      185                      Chad              0.768   2513
185      186                   Eritrea                 ..   1290
186      187  Central African Republic              0.773    689
187      188                     Niger              0.729   1319

[188 rows x 4 columns]

In [179]:
df.drop(["Male"],axis=1,inplace=True)

In [180]:
df

     GDIRank Genderdevelopment  female
0          1              0.996  57140
1          2              0.976  33688
2          3               0.95  44132
3          4              0.977  36439
4          5              0.947  29500
..       ...                ...    ...
183      184              0.911    693
184      185              0.768   1657
185      186                 ..    971
186      187              0.773    476
187      188              0.729    491

[188 rows x 3 columns]

In [181]:
a=open(r"C:\Users\ANKIT\Documents\tec\ankit.txt","w")

In [183]:
a.write("my name is ankit yadav")

22

In [184]:
a.close()

In [185]:
a=open(r"C:\Users\ANKIT\Documents\tec\ankit.txt","r")

In [186]:
a.read()

'my name is ankit aydavmy name is ankit yadav'

In [187]:
a=open(r"C:\Users\ANKIT\Documents\tec\ankit.txt","a")

In [188]:
a.write("data structure in c")

19

In [189]:
a.close()

In [191]:
a=open(r"C:\Users\ANKIT\Documents\tec\ankit.txt","r")

In [192]:
a.read()

'my name is ankit aydavmy name is ankit yadavdata structure in c'